stage0-vm-unix-c-forth/forth-interpreter.org
* High-level overview
#+CAPTION: *unix-c-forth.c*
#+NAME: unix-c-forth.c
#+BEGIN_SRC C :tangle unix-c-forth.c
<<includes>>
#include "unix-c-forth.h"

extern forth_instruction forth_main;
extern int level;
forth_instruction *next_inst;
<<globals>>

<<before main>>

void
print_state() {
  print_frame_stack();
  print_next_inst();
  print_value_stack();
  print_heap();
  fflush(stdout);
}

void
exit_handler() {
  print_state();
  <<exit clean-up>>
}

int
main(int argc, char **argv) {
  <<set up signal handling>>
  <<parse arguments>>
  <<initialize variables>>
  atexit(exit_handler);

  <<compile input files>>

  if (!arguments.no_repl) {
    next_inst = &forth_main;
    int exit_loop = 0;
    while (exit_loop != -1) { // 'next' trampoline
      exit_loop = unpack_and_execute_instruction(*next_inst++);
    }
  }

  <<output compiled heap>>

  exit(0);
}
#+END_SRC

An encoded instruction is a 32-bit value, representing the offset from
the start of instruction space to where the pointer to the interpreter
is. It is decoded to be a function pointer before executing the
interpreter it points to. The return stack contains pointers to the
next encoded instruction to execute.
#+CAPTION: *types.h*
#+NAME: types.h 1
#+BEGIN_SRC C :tangle types.h
#ifndef _UNIX_C_FORTH_TYPES_H_
#define _UNIX_C_FORTH_TYPES_H_

#include <stdint.h>
#include <stdio.h>

typedef uint32_t forth_instruction;
typedef int  (*forth_instruction_decoded)(forth_instruction*);
#+END_SRC

#+CAPTION: ~<<globals>>~
#+NAME: globals 1
#+BEGIN_SRC C :noweb-ref globals
FILE *input_stream;
FILE *output_stream;
forth_instruction **frame_stack, **frame_stack_bottom, **frame_stack_top;
#+END_SRC

We also have types for a cell, which is a standard unit on the value
stack, and on the heap.
#+CAPTION: *types.h*
#+NAME: types.h 2
#+BEGIN_SRC C :tangle types.h
typedef int32_t  scell;
typedef uint32_t ucell;

extern FILE *input_stream;
extern FILE *output_stream;
extern forth_instruction forth_main;
extern forth_instruction *next_inst;
extern forth_instruction **frame_stack, **frame_stack_bottom, **frame_stack_top;
extern scell *value_stack, *value_stack_bottom, *value_stack_top;
extern scell *HERE_LOC, *heap_bottom, *heap_top;
#+END_SRC

#+CAPTION: ~<<globals>>~
#+NAME: globals 2
#+BEGIN_SRC C :noweb-ref globals
scell *value_stack, *value_stack_bottom, *value_stack_top;
scell *HERE_LOC, *heap_bottom, *heap_top;
#+END_SRC

The conversion from ~forth_instruction~ to ~forth_instruction_decoded~
is by offsetting it from the base of the heap. This involves some
complicated casting, so it has been broken up into several variables.
#+CAPTION: *unix-c-forth.h*
#+NAME: unix-c-forth.h
#+BEGIN_SRC C :tangle unix-c-forth.h :noweb tangle
#ifndef _UNIX_C_FORTH_SIMPLE_FORTH_H_
#define _UNIX_C_FORTH_SIMPLE_FORTH_H_

#include "types.h"
int unpack_and_execute_instruction(forth_instruction inst);

#endif // _UNIX_C_FORTH_SIMPLE_FORTH_H_
#+END_SRC

#+CAPTION: ~<<before main>>~
#+NAME: before main 1
#+BEGIN_SRC C :noweb-ref "before main"
int
unpack_and_execute_instruction(forth_instruction inst)
{
  typedef forth_instruction_decoded decoded;
  // Offset is in bytes
  uint8_t *byte_addressed_heap = (uint8_t*)0; // TODO
  uint8_t *interpreter_ptr_addr = byte_addressed_heap + inst;
  // Convert to pointer, so that dereferencing loads a whole cell,,
  // not just a byte
  scell *interpreter_ptr_cell = (scell *)interpreter_ptr_addr;
  decoded interpreter_ptr = (decoded)(uintptr_t)*interpreter_ptr_cell;
  // Skip interpreter pointer, to the first forth instruction
  scell *first_forth_instruction = interpreter_ptr_cell+1;
  return (*interpreter_ptr)((forth_instruction*)first_forth_instruction);
}
#+END_SRC

