stage0-vm-unix-c-forth/forth-interpreter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-02 Sun 02:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unix C part of the simple Forth interpreter</title>
<meta name="author" content="Robert Kovacsics (rmk35)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Unix C part of the simple Forth interpreter</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29005c6">1. High-level overview</a></li>
<li><a href="#orge12fcfa">2. Putting it together</a></li>
<li><a href="#org976ad7b">3. Command-line arguments</a>
<ul>
<li><a href="#org9c1fd35">3.1. Allocating stacks and heap</a></li>
</ul>
</li>
<li><a href="#org08759ee">4. Unix-signal handling (to print stacks)</a></li>
<li><a href="#orgd9777de">5. Printing stacks and heaps</a>
<ul>
<li><a href="#org343e7ee">5.1. Mapping addresses to names</a></li>
</ul>
</li>
<li><a href="#org5b809a5">6. Compiling input files</a></li>
<li><a href="#org9a40683">7. Outputting compiled heap</a></li>
<li><a href="#org8611ae8">8. Basic words</a>
<ul>
<li><a href="#orgd073f96">8.1. C implementation</a></li>
<li><a href="#org82a152f">8.2. Mapping to dictionary entries</a></li>
</ul>
</li>
<li><a href="#org2aa4d28">9. <code>[0/1]</code> Tasks</a>
<ul>
<li><a href="#org75f118d">9.1. <span class="todo TODO">TODO</span> Linker</a>
<ul>
<li><a href="#org1b3d506">9.1.1. Dynamic linking</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org29005c6" class="outline-2">
<h2 id="org29005c6"><span class="section-number-2">1.</span> High-level overview</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span><b>unix-c-forth.c</b></label><pre class="src src-C" id="org1693303">&lt;&lt;includes&gt;&gt;
<span class="org-preprocessor">#include</span> <span class="org-string">"unix-c-forth.h"</span>

<span class="org-keyword">extern</span> forth_instruction forth_main;
<span class="org-keyword">extern</span> <span class="org-type">int</span> <span class="org-variable-name">level</span>;
<span class="org-type">forth_instruction</span> *<span class="org-variable-name">next_inst</span>;
&lt;&lt;globals&gt;&gt;

&lt;&lt;before main&gt;&gt;

<span class="org-type">void</span>
print_state() {
  print_frame_stack();
  print_next_inst();
  print_value_stack();
  print_heap();
  fflush(stdout);
}

<span class="org-type">void</span>
<span class="org-function-name">exit_handler</span>() {
  print_state();
  &lt;&lt;exit clean-up&gt;&gt;
}

<span class="org-type">int</span>
<span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> **<span class="org-variable-name">argv</span>) {
  &lt;&lt;set up signal handling&gt;&gt;
  &lt;&lt;parse arguments&gt;&gt;
  &lt;&lt;initialize variables&gt;&gt;
  atexit(exit_handler);

  &lt;&lt;compile input files&gt;&gt;

  <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>arguments.no_repl) {
    next_inst = &amp;forth_main;
    <span class="org-type">int</span> <span class="org-variable-name">exit_loop</span> = 0;
    <span class="org-keyword">while</span> (exit_loop != -1) { <span class="org-comment-delimiter">// </span><span class="org-comment">'next' trampoline</span>
      exit_loop = unpack_and_execute_instruction(*next_inst++);
    }
  }

  &lt;&lt;output compiled heap&gt;&gt;

  exit(0);
}
</pre>
</div>

<p>
An encoded instruction is a 32-bit value, representing the offset from
the start of instruction space to where the pointer to the interpreter
is. It is decoded to be a function pointer before executing the
interpreter it points to. The return stack contains pointers to the
next encoded instruction to execute.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span><b>types.h</b></label><pre class="src src-C" id="orge22dcbe"><span class="org-preprocessor">#if</span><span class="org-negation-char"><span class="org-preprocessor">n</span></span><span class="org-preprocessor">def</span> _UNIX_C_FORTH_TYPES_H_
<span class="org-preprocessor">#define</span> <span class="org-variable-name">_UNIX_C_FORTH_TYPES_H_</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdint.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-keyword">typedef</span> <span class="org-type">uint32_t</span> <span class="org-type">forth_instruction</span>;
<span class="org-keyword">typedef</span> <span class="org-type">int</span>  (*<span class="org-type">forth_instruction_decoded</span>)(<span class="org-type">forth_instruction</span>*);
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span><code>&lt;&lt;globals&gt;&gt;</code></label><pre class="src src-C" id="org42a42cb"><span class="org-type">FILE</span> *<span class="org-variable-name">input_stream</span>;
<span class="org-type">FILE</span> *<span class="org-variable-name">output_stream</span>;
<span class="org-type">forth_instruction</span> **<span class="org-variable-name">frame_stack</span>, **<span class="org-variable-name">frame_stack_bottom</span>, **<span class="org-variable-name">frame_stack_top</span>;
</pre>
</div>

<p>
We also have types for a cell, which is a standard unit on the value
stack, and on the heap.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span><b>types.h</b></label><pre class="src src-C" id="orgffa81d2"><span class="org-keyword">typedef</span> <span class="org-type">int32_t</span>  <span class="org-type">scell</span>;
<span class="org-keyword">typedef</span> <span class="org-type">uint32_t</span> <span class="org-type">ucell</span>;

<span class="org-keyword">extern</span> <span class="org-type">FILE</span> *<span class="org-variable-name">input_stream</span>;
<span class="org-keyword">extern</span> <span class="org-type">FILE</span> *<span class="org-variable-name">output_stream</span>;
<span class="org-keyword">extern</span> <span class="org-type">forth_instruction</span> <span class="org-variable-name">forth_main</span>;
<span class="org-keyword">extern</span> <span class="org-type">forth_instruction</span> *<span class="org-variable-name">next_inst</span>;
<span class="org-keyword">extern</span> <span class="org-type">forth_instruction</span> **<span class="org-variable-name">frame_stack</span>, **<span class="org-variable-name">frame_stack_bottom</span>, **<span class="org-variable-name">frame_stack_top</span>;
<span class="org-keyword">extern</span> <span class="org-type">scell</span> *<span class="org-variable-name">value_stack</span>, *<span class="org-variable-name">value_stack_bottom</span>, *<span class="org-variable-name">value_stack_top</span>;
<span class="org-keyword">extern</span> <span class="org-type">scell</span> *<span class="org-variable-name">HERE_LOC</span>, *<span class="org-variable-name">heap_bottom</span>, *<span class="org-variable-name">heap_top</span>;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span><code>&lt;&lt;globals&gt;&gt;</code></label><pre class="src src-C" id="orgd9c54b8"><span class="org-type">scell</span> *<span class="org-variable-name">value_stack</span>, *<span class="org-variable-name">value_stack_bottom</span>, *<span class="org-variable-name">value_stack_top</span>;
<span class="org-type">scell</span> *<span class="org-variable-name">HERE_LOC</span>, *<span class="org-variable-name">heap_bottom</span>, *<span class="org-variable-name">heap_top</span>;
</pre>
</div>

<p>
The conversion from <code>forth_instruction</code> to <code>forth_instruction_decoded</code>
is by offsetting it from the base of the heap. This involves some
complicated casting, so it has been broken up into several variables.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span><b>unix-c-forth.h</b></label><pre class="src src-C" id="org28a7f9d"><span class="org-preprocessor">#if</span><span class="org-negation-char"><span class="org-preprocessor">n</span></span><span class="org-preprocessor">def</span> _UNIX_C_FORTH_SIMPLE_FORTH_H_
<span class="org-preprocessor">#define</span> <span class="org-variable-name">_UNIX_C_FORTH_SIMPLE_FORTH_H_</span>

<span class="org-preprocessor">#include</span> <span class="org-string">"types.h"</span>
<span class="org-type">int</span> <span class="org-function-name">unpack_and_execute_instruction</span>(<span class="org-type">forth_instruction</span> <span class="org-variable-name">inst</span>);

<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">// </span><span class="org-comment">_UNIX_C_FORTH_SIMPLE_FORTH_H_</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="orgad5cfb3"><span class="org-type">int</span>
<span class="org-function-name">unpack_and_execute_instruction</span>(<span class="org-type">forth_instruction</span> <span class="org-variable-name">inst</span>)
{
  <span class="org-keyword">typedef</span> <span class="org-type">forth_instruction_decoded</span> <span class="org-type">decoded</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Offset is in bytes</span>
  <span class="org-type">uint8_t</span> *<span class="org-variable-name">byte_addressed_heap</span> = (<span class="org-type">uint8_t</span>*)0; <span class="org-comment-delimiter">// </span><span class="org-comment">TODO</span>
  <span class="org-type">uint8_t</span> *<span class="org-variable-name">interpreter_ptr_addr</span> = byte_addressed_heap + inst;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Convert to pointer, so that dereferencing loads a whole cell,,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">not just a byte</span>
  <span class="org-type">scell</span> *<span class="org-variable-name">interpreter_ptr_cell</span> = (<span class="org-type">scell</span> *)interpreter_ptr_addr;
  <span class="org-type">decoded</span> <span class="org-variable-name">interpreter_ptr</span> = (<span class="org-type">decoded</span>)(<span class="org-type">uintptr_t</span>)*interpreter_ptr_cell;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Skip interpreter pointer, to the first forth instruction</span>
  <span class="org-type">scell</span> *<span class="org-variable-name">first_forth_instruction</span> = interpreter_ptr_cell+1;
  <span class="org-keyword">return</span> (*interpreter_ptr)((<span class="org-type">forth_instruction</span>*)first_forth_instruction);
}
</pre>
</div>
</div>
</div>
