stage0-vm-unix-c-forth/forth-interpreter.org
* Putting it together
#+CAPTION: *Makefile*
#+NAME: Makefile
#+BEGIN_SRC Makefile :tangle Makefile
BUILDDIR := ../build
SRCS := unix-c-forth.c c-words.c arguments.c
OBJS := $(patsubst %.c,%.o,$(SRCS)) words.o

CFLAGS := -g -rdynamic $(CFLAGS)
LIBS   := -lc -ldl

.PHONY: all
all: unix-c-forth

unix-c-forth: $(OBJS)
	cc $(CFLAGS) $^ -o $@ $(LIBS)

words.o: c-words.s $(BUILDDIR)/stage0.s $(BUILDDIR)/stage1.s vars.s
	as -g $^ -o $@

.PHONY: clean
clean:
	rm simple-c-forth $(OBJS)
#+END_SRC

#+CAPTION: *vars.s*
#+NAME: vars.s
#+BEGIN_SRC asm :tangle vars.s
.data
.balign 4
.globl previous_entry, LATEST_LOC
LATEST_LOC:   .cell previous_entry
#+END_SRC
