stage0-vm-unix-c-forth/forth-interpreter.html

<div id="outline-container-orge12fcfa" class="outline-2">
<h2 id="orge12fcfa"><span class="section-number-2">2.</span> Putting it together</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span><b>Makefile</b></label><pre class="src src-Makefile" id="org18837ab">BUILDDIR := ../build
SRCS := unix-c-forth.c c-words.c arguments.c
OBJS := $(patsubst %.c,%.o,$(SRCS)) words.o

CFLAGS := -g -rdynamic $(CFLAGS)
LIBS   := -lc -ldl

.PHONY: all
all: unix-c-forth

unix-c-forth: $(OBJS)
	cc $(CFLAGS) $^ -o $@ $(LIBS)

words.o: c-words.s $(BUILDDIR)/stage0.s $(BUILDDIR)/stage1.s vars.s
	as -g $^ -o $@

.PHONY: clean
clean:
	rm simple-c-forth $(OBJS)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span><b>vars.s</b></label><pre class="src src-asm" id="orge218dec"><span class="org-keyword">.data</span>
<span class="org-keyword">.balign</span> 4
<span class="org-keyword">.globl</span> previous_entry, LATEST_LOC
<span class="org-function-name">LATEST_LOC</span>:   .cell previous_entry
</pre>
</div>
</div>
</div>
