stage0-vm-unix-c-forth/forth-interpreter.org
* Command-line arguments
#+CAPTION: ~<<includes>>~
#+NAME: includes 1
#+BEGIN_SRC C :noweb-ref includes
#include "arguments.h"
#+END_SRC

#+CAPTION: *arguments.h*
#+NAME: arguments.h
#+BEGIN_SRC C :tangle arguments.h
#ifndef _UNIX_C_FORTH_ARGUMENTS_H_
#define _UNIX_C_FORTH_ARGUMENTS_H_

#include <argp.h>

#include "types.h"

/* Used by main to communicate with parse_opt. */
struct arguments
{
  uint64_t values_size;
  uint64_t frames_size;
  uint64_t heap_size;
  char *output;
  uint64_t offset;
  char **inputs;
  unsigned input_count;
  short no_repl;
  short target_word_size;
  short target_le;
};

void
parse_arguments(int argc, char **argv, struct arguments *arguments);

#endif // _UNIX_C_FORTH_ARGUMENTS_H_
#+END_SRC

#+CAPTION: *arguments.c*
#+NAME: arguments.c
#+BEGIN_SRC C :tangle arguments.c
#include <stdlib.h>

#include "arguments.h"

const char *argp_program_version =
  "simple-c-forth 1.0";
const char *argp_program_bug_address =
  "Robert Kovacsics <rmk35@cl.cam.ac.uk>";

/* Program documentation. */
static char doc[] =
  "A simple forth interpreter written in C, part of "
  "https://github.com/KoviRobi/simple-forth";

/* A description of the arguments we accept. */
static char args_doc[] = "[Input files]";

/* The options we understand. */
static struct argp_option options[] = {
  {"little-endian",    'l', 0,          0,
    "Target is a little-endian system" },
  {"el",               'l', 0,          OPTION_ALIAS },
  {"no-repl",         'n', 0,          0,
    "Don't open a REPL on the standard input" },
  {"value-stack",      'v', "elements", 0,
    "Size of the value stack (in elements)" },
  {"value-stack-size", 'v', "elements", OPTION_ALIAS },
  {"frame-stack",      'f', "elements", 0,
    "Size of the frame stack (in elements)" },
  {"frame-stack-size", 'f', "elements", OPTION_ALIAS },
  {"heap",             'H', "bytes",    0,
    "Size of the heap (in bytes)" },
  {"heap-size",        'H', "bytes",    OPTION_ALIAS },
  {"output",           'o', "file",     0,
    "Output dump of compiling input files" },
  {"offset",           'O', "bytes",    0,
    "Offset for output file (default is zero, i.e. first"
    " compiled word is at 0)" },
  // TODO: builtin words
  {"word",             'w', "bits",     0,
    "Size of a forth word for output file (in bits)" },
  {"target-word-size", 'w', "bits",     OPTION_ALIAS },
  { 0 }
};

/* Parse a single option. */
static error_t
parse_opt (int key, char *arg, struct argp_state *state)
{
  struct arguments *arguments = state->input;

  switch (key)
  {
    case 'l': arguments->target_le         = 1;         break;
    case 'n': arguments->no_repl           = 1;         break;
    case 'v': arguments->values_size       = atoi(arg); break;
    case 'f': arguments->frames_size       = atoi(arg); break;
    case 'H': arguments->heap_size         = atoi(arg); break;
    case 'o': arguments->output            = arg;       break;
    case 'O': arguments->offset            = atoi(arg); break;
    case 'w': arguments->target_word_size  = atoi(arg); break;

    case ARGP_KEY_ARG:
      arguments->inputs = &state->argv[state->next-1];
      arguments->input_count = state->argc - (state->next - 1);
      state->next = state->argc; // Stop parsing
      break;

    default:
      return ARGP_ERR_UNKNOWN;
  }
  return 0;
}

/* Our argp parser. */
static struct argp argp = { options, parse_opt, args_doc, doc };

void
parse_arguments(int argc, char **argv, struct arguments *arguments)
{
  argp_parse(&argp, argc, argv, 0, 0, arguments);
}
#+END_SRC

#+CAPTION: ~<<parse arguments>>~
#+NAME: parse arguments
#+BEGIN_SRC C
struct arguments arguments;
arguments.values_size      = 1024;
arguments.frames_size      = 1024;
arguments.heap_size        = 4096;
arguments.output           = NULL;
arguments.offset           = 0;
arguments.inputs           = 0;
arguments.input_count      = 0;
arguments.no_repl          = 0;
arguments.target_word_size = 32;
arguments.target_le        = 0;
parse_arguments(argc, argv, &arguments);
#+END_SRC
