stage0-vm-unix-c-forth/forth-interpreter.html
<div id="outline-container-org976ad7b" class="outline-2">
<h2 id="org976ad7b"><span class="section-number-2">3.</span> Command-line arguments</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span><code>&lt;&lt;includes&gt;&gt;</code></label><pre class="src src-C" id="org99b02d2"><span class="org-preprocessor">#include</span> <span class="org-string">"arguments.h"</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span><b>arguments.h</b></label><pre class="src src-C" id="orge891323"><span class="org-preprocessor">#if</span><span class="org-negation-char"><span class="org-preprocessor">n</span></span><span class="org-preprocessor">def</span> _UNIX_C_FORTH_ARGUMENTS_H_
<span class="org-preprocessor">#define</span> <span class="org-variable-name">_UNIX_C_FORTH_ARGUMENTS_H_</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;argp.h&gt;</span>

<span class="org-preprocessor">#include</span> <span class="org-string">"types.h"</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">Used by main to communicate with parse_opt.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">struct</span> <span class="org-type">arguments</span>
{
  <span class="org-type">uint64_t</span> <span class="org-variable-name">values_size</span>;
  <span class="org-type">uint64_t</span> <span class="org-variable-name">frames_size</span>;
  <span class="org-type">uint64_t</span> <span class="org-variable-name">heap_size</span>;
  <span class="org-type">char</span> *<span class="org-variable-name">output</span>;
  <span class="org-type">uint64_t</span> <span class="org-variable-name">offset</span>;
  <span class="org-type">char</span> **<span class="org-variable-name">inputs</span>;
  <span class="org-type">unsigned</span> <span class="org-variable-name">input_count</span>;
  <span class="org-type">short</span> <span class="org-variable-name">no_repl</span>;
  <span class="org-type">short</span> <span class="org-variable-name">target_word_size</span>;
  <span class="org-type">short</span> <span class="org-variable-name">target_le</span>;
};

<span class="org-type">void</span>
<span class="org-function-name">parse_arguments</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> **<span class="org-variable-name">argv</span>, <span class="org-keyword">struct</span> <span class="org-type">arguments</span> *<span class="org-variable-name">arguments</span>);

<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">// </span><span class="org-comment">_UNIX_C_FORTH_ARGUMENTS_H_</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 12: </span><b>arguments.c</b></label><pre class="src src-C" id="org03d536d"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdlib.h&gt;</span>

<span class="org-preprocessor">#include</span> <span class="org-string">"arguments.h"</span>

<span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">argp_program_version</span> =
  <span class="org-string">"simple-c-forth 1.0"</span>;
<span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">argp_program_bug_address</span> =
  <span class="org-string">"Robert Kovacsics <a href="mailto:rmk35%40cl.cam.ac.uk">&lt;rmk35@cl.cam.ac.uk&gt;</a>"</span>;

<span class="org-comment-delimiter">/* </span><span class="org-comment">Program documentation.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">static</span> <span class="org-type">char</span> <span class="org-variable-name">doc</span>[] =
  <span class="org-string">"A simple forth interpreter written in C, part of "</span>
  <span class="org-string">"https://github.com/KoviRobi/simple-forth"</span>;

<span class="org-comment-delimiter">/* </span><span class="org-comment">A description of the arguments we accept.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">static</span> <span class="org-type">char</span> <span class="org-variable-name">args_doc</span>[] = <span class="org-string">"[Input files]"</span>;

<span class="org-comment-delimiter">/* </span><span class="org-comment">The options we understand.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">static</span> <span class="org-keyword">struct</span> <span class="org-type">argp_option</span> <span class="org-variable-name">options</span>[] = {
  {<span class="org-string">"little-endian"</span>,    <span class="org-string">'l'</span>, 0,          0,
    <span class="org-string">"Target is a little-endian system"</span> },
  {<span class="org-string">"el"</span>,               <span class="org-string">'l'</span>, 0,          OPTION_ALIAS },
  {<span class="org-string">"no-repl"</span>,         <span class="org-string">'n'</span>, 0,          0,
    <span class="org-string">"Don't open a REPL on the standard input"</span> },
  {<span class="org-string">"value-stack"</span>,      <span class="org-string">'v'</span>, <span class="org-string">"elements"</span>, 0,
    <span class="org-string">"Size of the value stack (in elements)"</span> },
  {<span class="org-string">"value-stack-size"</span>, <span class="org-string">'v'</span>, <span class="org-string">"elements"</span>, OPTION_ALIAS },
  {<span class="org-string">"frame-stack"</span>,      <span class="org-string">'f'</span>, <span class="org-string">"elements"</span>, 0,
    <span class="org-string">"Size of the frame stack (in elements)"</span> },
  {<span class="org-string">"frame-stack-size"</span>, <span class="org-string">'f'</span>, <span class="org-string">"elements"</span>, OPTION_ALIAS },
  {<span class="org-string">"heap"</span>,             <span class="org-string">'H'</span>, <span class="org-string">"bytes"</span>,    0,
    <span class="org-string">"Size of the heap (in bytes)"</span> },
  {<span class="org-string">"heap-size"</span>,        <span class="org-string">'H'</span>, <span class="org-string">"bytes"</span>,    OPTION_ALIAS },
  {<span class="org-string">"output"</span>,           <span class="org-string">'o'</span>, <span class="org-string">"file"</span>,     0,
    <span class="org-string">"Output dump of compiling input files"</span> },
  {<span class="org-string">"offset"</span>,           <span class="org-string">'O'</span>, <span class="org-string">"bytes"</span>,    0,
    <span class="org-string">"Offset for output file (default is zero, i.e. first"</span>
    <span class="org-string">" compiled word is at 0)"</span> },
  <span class="org-comment-delimiter">// </span><span class="org-comment">TODO: builtin words</span>
  {<span class="org-string">"word"</span>,             <span class="org-string">'w'</span>, <span class="org-string">"bits"</span>,     0,
    <span class="org-string">"Size of a forth word for output file (in bits)"</span> },
  {<span class="org-string">"target-word-size"</span>, <span class="org-string">'w'</span>, <span class="org-string">"bits"</span>,     OPTION_ALIAS },
  { 0 }
};

<span class="org-comment-delimiter">/* </span><span class="org-comment">Parse a single option.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">static</span> <span class="org-type">error_t</span>
<span class="org-function-name">parse_opt</span> (<span class="org-type">int</span> <span class="org-variable-name">key</span>, <span class="org-type">char</span> *<span class="org-variable-name">arg</span>, <span class="org-keyword">struct</span> <span class="org-type">argp_state</span> *<span class="org-variable-name">state</span>)
{
  <span class="org-keyword">struct</span> <span class="org-type">arguments</span> *<span class="org-variable-name">arguments</span> = state-&gt;input;

  <span class="org-keyword">switch</span> (key)
  {
    <span class="org-keyword">case</span> <span class="org-string">'l'</span>: arguments-&gt;target_le         = 1;         <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'n'</span>: arguments-&gt;no_repl           = 1;         <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'v'</span>: arguments-&gt;values_size       = atoi(arg); <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'f'</span>: arguments-&gt;frames_size       = atoi(arg); <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'H'</span>: arguments-&gt;heap_size         = atoi(arg); <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'o'</span>: arguments-&gt;output            = arg;       <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'O'</span>: arguments-&gt;offset            = atoi(arg); <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> <span class="org-string">'w'</span>: arguments-&gt;target_word_size  = atoi(arg); <span class="org-keyword">break</span>;

    <span class="org-keyword">case</span> ARGP_KEY_ARG:
      arguments-&gt;inputs = &amp;state-&gt;argv[state-&gt;next-1];
      arguments-&gt;input_count = state-&gt;argc - (state-&gt;next - 1);
      state-&gt;next = state-&gt;argc; <span class="org-comment-delimiter">// </span><span class="org-comment">Stop parsing</span>
      <span class="org-keyword">break</span>;

    <span class="org-keyword">default</span>:
      <span class="org-keyword">return</span> ARGP_ERR_UNKNOWN;
  }
  <span class="org-keyword">return</span> 0;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">Our argp parser.</span><span class="org-comment-delimiter"> */</span>
<span class="org-keyword">static</span> <span class="org-keyword">struct</span> <span class="org-type">argp</span> <span class="org-variable-name">argp</span> = { options, parse_opt, args_doc, doc };

<span class="org-type">void</span>
<span class="org-function-name">parse_arguments</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span> **<span class="org-variable-name">argv</span>, <span class="org-keyword">struct</span> <span class="org-type">arguments</span> *<span class="org-variable-name">arguments</span>)
{
  argp_parse(&amp;argp, argc, argv, 0, 0, arguments);
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span><code>&lt;&lt;parse arguments&gt;&gt;</code></label><pre class="src src-C" id="orgb2817c1"><span class="org-keyword">struct</span> <span class="org-type">arguments</span> <span class="org-variable-name">arguments</span>;
arguments.values_size      = 1024;
arguments.frames_size      = 1024;
arguments.heap_size        = 4096;
arguments.output           = <span class="org-constant">NULL</span>;
arguments.offset           = 0;
arguments.inputs           = 0;
arguments.input_count      = 0;
arguments.no_repl          = 0;
arguments.target_word_size = 32;
arguments.target_le        = 0;
<span class="org-function-name">parse_arguments</span>(argc, argv, &amp;arguments);
</pre>
</div>
</div>
