stage0-vm-unix-c-forth/forth-interpreter.org
** Allocating stacks and heap
#+CAPTION: ~<<before main>>~
#+NAME: before main 2
#+BEGIN_SRC C :noweb-ref "before main"
void *allocate(unsigned int count, unsigned int size) {
  void *rtn = calloc(count, size);
  if ((void *)rtn == NULL) perror("Failed to allocate");
  return rtn;
}
#+END_SRC

#+CAPTION: ~<<initialize variables>>~
#+NAME: initialize variables
#+BEGIN_SRC C
input_stream = stdin;
output_stream = stdout;
frame_stack = allocate(arguments.frames_size, sizeof(forth_instruction*));
frame_stack_bottom = frame_stack;
frame_stack_top = frame_stack_bottom + arguments.frames_size;
value_stack = allocate(arguments.values_size, sizeof(scell));
value_stack_bottom = value_stack;
value_stack_top = value_stack_bottom + arguments.values_size;
HERE_LOC = allocate(arguments.heap_size, sizeof(scell));
heap_bottom = HERE_LOC;
heap_top = heap_bottom + arguments.heap_size;
#+END_SRC
* Unix-signal handling (to print stacks)
#+CAPTION: ~<<includes>>~
#+NAME: includes 2
#+BEGIN_SRC C :noweb-ref includes
#include <signal.h>
#+END_SRC
#+CAPTION: ~<<set up signal handling>>~
#+NAME: set up signal handling
#+BEGIN_SRC C
struct sigaction new_action, old_action;
new_action.sa_handler = exit;
sigemptyset (&new_action.sa_mask);
new_action.sa_flags = 0;
sigaction (SIGINT, NULL, &old_action);
if (old_action.sa_handler != SIG_IGN)
  sigaction (SIGINT, &new_action, NULL);
new_action.sa_handler = print_state;
sigaction (SIGQUIT, NULL, &old_action);
if (old_action.sa_handler != SIG_IGN)
  sigaction (SIGQUIT, &new_action, NULL);
#+END_SRC
* Printing stacks and heaps
#+CAPTION: ~<<before main>>~
#+NAME: before main 3
#+BEGIN_SRC C :noweb-ref "before main"
void
print_value_stack() {
  printf("Values (bottom first)\n");
  for (scell *i = value_stack_bottom; i < value_stack; ++i)
    printf("%12d %12u 0x%08x\n", *i, *i, *i);
}
#+END_SRC

#+CAPTION: ~<<before main>>~
#+NAME: before main 4
#+BEGIN_SRC C :noweb-ref "before main"
char
char_disp(char *p) {
  char c = *p;
  if (c < 32 || c > 126) return ' ';
  else return c;
}

void
print_heap() {
  printf("Heap (%p--%p):\n", heap_bottom, HERE_LOC);
  char *p = (char*)heap_bottom;
  // Print in block of 4 bytes
  for (; p+3 < (char*)HERE_LOC; p += 4) {
    printf("%p:\t0x%08x\t%c%c%c%c\n",
           (void*)p,
           *(uint32_t*)p,
           char_disp(p), char_disp(p+1),
           char_disp(p+2), char_disp(p+3));
  }
  // Print the remaining bytes
  if (p < (char*)HERE_LOC) {
    printf("%p:\t", (void*)p);
    intptr_t diff = (char*)HERE_LOC - p;
    uint32_t mask = (1<<(diff*8))-1;
    uint32_t value = *(uint32_t*)p;
    printf("0x%08x\t", value&mask);
    for (char *c = p; c < (char*)HERE_LOC; c += 1)
      printf("%c", char_disp(c));
    printf("\n");
  }
}
#+END_SRC

