stage0-vm-unix-c-forth/forth-interpreter.html
<div id="outline-container-org9c1fd35" class="outline-3">
<h3 id="org9c1fd35"><span class="section-number-3">3.1.</span> Allocating stacks and heap</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="org120cdf9"><span class="org-type">void</span> *<span class="org-function-name">allocate</span>(<span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">count</span>, <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">size</span>) {
  <span class="org-type">void</span> *<span class="org-variable-name">rtn</span> = calloc(count, size);
  <span class="org-keyword">if</span> ((<span class="org-type">void</span> *)rtn == <span class="org-constant">NULL</span>) perror(<span class="org-string">"Failed to allocate"</span>);
  <span class="org-keyword">return</span> rtn;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span><code>&lt;&lt;initialize variables&gt;&gt;</code></label><pre class="src src-C" id="org7bdde58">input_stream = stdin;
output_stream = stdout;
frame_stack = allocate(arguments.frames_size, <span class="org-keyword">sizeof</span>(<span class="org-type">forth_instruction</span>*));
frame_stack_bottom = frame_stack;
frame_stack_top = frame_stack_bottom + arguments.frames_size;
value_stack = allocate(arguments.values_size, <span class="org-keyword">sizeof</span>(scell));
value_stack_bottom = value_stack;
value_stack_top = value_stack_bottom + arguments.values_size;
HERE_LOC = allocate(arguments.heap_size, <span class="org-keyword">sizeof</span>(scell));
heap_bottom = HERE_LOC;
heap_top = heap_bottom + arguments.heap_size;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org08759ee" class="outline-2">
<h2 id="org08759ee"><span class="section-number-2">4.</span> Unix-signal handling (to print stacks)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span><code>&lt;&lt;includes&gt;&gt;</code></label><pre class="src src-C" id="org2533432"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;signal.h&gt;</span>
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span><code>&lt;&lt;set up signal handling&gt;&gt;</code></label><pre class="src src-C" id="org83f8bbf"><span class="org-keyword">struct</span> <span class="org-type">sigaction</span> <span class="org-variable-name">new_action</span>, <span class="org-variable-name">old_action</span>;
new_action.sa_handler = exit;
sigemptyset (&amp;new_action.sa_mask);
new_action.sa_flags = 0;
<span class="org-function-name">sigaction</span> (SIGINT, <span class="org-constant">NULL</span>, &amp;old_action);
<span class="org-keyword">if</span> (old_action.sa_handler != SIG_IGN)
  <span class="org-function-name">sigaction</span> (SIGINT, &amp;new_action, <span class="org-constant">NULL</span>);
new_action.sa_handler = print_state;
<span class="org-function-name">sigaction</span> (SIGQUIT, <span class="org-constant">NULL</span>, &amp;old_action);
<span class="org-keyword">if</span> (old_action.sa_handler != SIG_IGN)
  <span class="org-function-name">sigaction</span> (SIGQUIT, &amp;new_action, <span class="org-constant">NULL</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9777de" class="outline-2">
<h2 id="orgd9777de"><span class="section-number-2">5.</span> Printing stacks and heaps</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="org35d9311"><span class="org-type">void</span>
<span class="org-function-name">print_value_stack</span>() {
  printf(<span class="org-string">"Values (bottom first)\n"</span>);
  <span class="org-keyword">for</span> (<span class="org-type">scell</span> *<span class="org-variable-name">i</span> = value_stack_bottom; i &lt; value_stack; ++i)
    printf(<span class="org-string">"%12d %12u 0x%08x\n"</span>, *i, *i, *i);
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="org58aebde"><span class="org-type">char</span>
<span class="org-function-name">char_disp</span>(<span class="org-type">char</span> *<span class="org-variable-name">p</span>) {
  <span class="org-type">char</span> <span class="org-variable-name">c</span> = *p;
  <span class="org-keyword">if</span> (c &lt; 32 || c &gt; 126) <span class="org-keyword">return</span> <span class="org-string">' '</span>;
  <span class="org-keyword">else</span> <span class="org-keyword">return</span> c;
}

<span class="org-type">void</span>
<span class="org-function-name">print_heap</span>() {
  printf(<span class="org-string">"Heap (%p--%p):\n"</span>, heap_bottom, HERE_LOC);
  <span class="org-type">char</span> *<span class="org-variable-name">p</span> = (<span class="org-type">char</span>*)heap_bottom;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Print in block of 4 bytes</span>
  <span class="org-keyword">for</span> (; p+3 &lt; (<span class="org-type">char</span>*)HERE_LOC; p += 4) {
    printf(<span class="org-string">"%p:\t0x%08x\t%c%c%c%c\n"</span>,
           (<span class="org-type">void</span>*)p,
           *(<span class="org-type">uint32_t</span>*)p,
           char_disp(p), char_disp(p+1),
           char_disp(p+2), char_disp(p+3));
  }
  <span class="org-comment-delimiter">// </span><span class="org-comment">Print the remaining bytes</span>
  <span class="org-keyword">if</span> (p &lt; (<span class="org-type">char</span>*)HERE_LOC) {
    printf(<span class="org-string">"%p:\t"</span>, (<span class="org-type">void</span>*)p);
    <span class="org-type">intptr_t</span> <span class="org-variable-name">diff</span> = (<span class="org-type">char</span>*)HERE_LOC - p;
    <span class="org-type">uint32_t</span> <span class="org-variable-name">mask</span> = (1&lt;&lt;(diff*8))-1;
    <span class="org-type">uint32_t</span> <span class="org-variable-name">value</span> = *(<span class="org-type">uint32_t</span>*)p;
    printf(<span class="org-string">"0x%08x\t"</span>, value&amp;mask);
    <span class="org-keyword">for</span> (<span class="org-type">char</span> *<span class="org-variable-name">c</span> = p; c &lt; (<span class="org-type">char</span>*)HERE_LOC; c += 1)
      printf(<span class="org-string">"%c"</span>, char_disp(c));
    printf(<span class="org-string">"\n"</span>);
  }
}
</pre>
</div>
</div>
