stage0-vm-unix-c-forth/forth-interpreter.org
** Mapping addresses to names
#+CAPTION: ~<<includes>>~
#+NAME: includes 3
#+BEGIN_SRC C :noweb-ref includes
#include <dlfcn.h>
#include <stdlib.h>
#+END_SRC

#+CAPTION: *types.h*
#+NAME: types.h
#+BEGIN_SRC C :tangle types.h
char *addr2name(void *addr);
#endif // _UNIX_C_FORTH_TYPES_H_
#+END_SRC

#+CAPTION: ~<<globals>>~
#+NAME: globals 3
#+BEGIN_SRC C :noweb-ref globals
extern scell LATEST_LOC;
#+END_SRC
#+CAPTION: ~<<before main>>~
#+NAME: before main 5
#+BEGIN_SRC C :noweb-ref "before main"
typedef struct dict_entry {
  ucell prev;
  ucell flags;
  ucell name_len;
  char name_start;
} entry;

char *
addr2name(void *addr)
{
  for (entry *p = (entry*)(uintptr_t)LATEST_LOC; p != NULL;
              p = (entry*)(uintptr_t)p->prev)
    if ((uintptr_t)p<(uintptr_t)addr)
      return &p->name_start;
  return NULL;
}

void
print_frame_stack() {
  printf("Frames (bottom first)\n");
  for (forth_instruction **i = frame_stack_bottom; i < frame_stack; ++i) {
    char *name = addr2name(*i);
    printf("%8p\t%s\n", *i, name!=NULL?name:"Cannot translate");
  }
}
#+END_SRC

#+CAPTION: ~<<before main>>~
#+NAME: before main 6
#+BEGIN_SRC C :noweb-ref "before main"
void
print_next_inst() {
  if (next_inst != NULL) {
    char *name = addr2name(next_inst);
    char *name_end = name + ((ucell*)name)[-1] + 1; // name len + null byte
    uintptr_t offset = (uintptr_t)name_end;
    offset = (offset+3) & (~3); // 4-byte align
    printf("next inst:\n%8p\t%s+%lu\n", next_inst, name,
           ((uintptr_t)next_inst)-offset);
  }
}
#+END_SRC

* Compiling input files
#+CAPTION: ~<<includes>>~
#+NAME: includes 4
#+BEGIN_SRC C :noweb-ref includes
#include <err.h>
#+END_SRC

#+CAPTION: ~<<compile input files>>~
#+NAME: compile input files
#+BEGIN_SRC C
for (int i = 0; i < arguments.input_count; ++i)
{
  char *input = arguments.inputs[i];
  FILE *f = fopen(input, "r");
  if (f == NULL) {
    err(1, "Failed to open input file %s", input);
  }
  // set input stream to f;
  input_stream = f;
  next_inst = &forth_main;
  int exit_loop = 0;
  while (exit_loop != -1) { // 'next' trampoline
    exit_loop = unpack_and_execute_instruction(*next_inst++);
  }
  fclose(f);
}
scell *compiled_input_end = HERE_LOC;
input_stream = stdin;
#+END_SRC

* Outputting compiled heap
#+CAPTION: ~<<includes>>~
#+NAME: includes 5
#+BEGIN_SRC C :noweb-ref includes
#include <endian.h>
#+END_SRC

TODO: this won't convert properly, e.g. it will read chars as cells
and drop/byte swap them

#+CAPTION: ~<<output compiled heap>>~
#+NAME: output compiled heap
#+BEGIN_SRC C
if (arguments.output != NULL) {
  FILE *output = fopen(arguments.output, "w");
  if (output == NULL) {
    err(2, "Failed to open output file %s", arguments.output);
  }
  switch (arguments.target_word_size << 1 | arguments.target_le)
  {
#define be_value 0
#define le_value 1
#define mk_switch_case(bits,endian)                                    \
    case ((bits<<1)|endian##_value):                                   \
      for (ucell *word = heap_bottom; word < (ucell*)HERE_LOC; ++word) \
      { uint##bits##_t data = hto##endian##bits(*word);                \
        data += arguments.offset;                                      \
        fwrite(&data, sizeof(uint##bits##_t), 1, output);              \
      }                                                                \
      break;
mk_switch_case(32, le);
mk_switch_case(32, be);
mk_switch_case(16, le);
mk_switch_case(16, be);
#undef mk_switch_case
#undef be_value
#undef le_value
    default:
      errx(3, "Unsupported target word-size & endianness: %d %s",
           arguments.target_word_size, arguments.target_le==0?"be":"le");
  }
  fclose(output);
}
#+END_SRC

* Basic words
