stage0-vm-unix-c-forth/forth-interpreter.html

<div id="outline-container-org343e7ee" class="outline-3">
<h3 id="org343e7ee"><span class="section-number-3">5.1.</span> Mapping addresses to names</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 20: </span><code>&lt;&lt;includes&gt;&gt;</code></label><pre class="src src-C" id="orgbb73746"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;dlfcn.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdlib.h&gt;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 21: </span><b>types.h</b></label><pre class="src src-C" id="org22d321b"><span class="org-type">char</span> *<span class="org-function-name">addr2name</span>(<span class="org-type">void</span> *<span class="org-variable-name">addr</span>);
<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">// </span><span class="org-comment">_UNIX_C_FORTH_TYPES_H_</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 22: </span><code>&lt;&lt;globals&gt;&gt;</code></label><pre class="src src-C" id="orge146ceb"><span class="org-keyword">extern</span> <span class="org-type">scell</span> <span class="org-variable-name">LATEST_LOC</span>;
</pre>
</div>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 23: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="org5fafbb9"><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">dict_entry</span> {
  <span class="org-type">ucell</span> <span class="org-variable-name">prev</span>;
  <span class="org-type">ucell</span> <span class="org-variable-name">flags</span>;
  <span class="org-type">ucell</span> <span class="org-variable-name">name_len</span>;
  <span class="org-type">char</span> <span class="org-variable-name">name_start</span>;
} <span class="org-type">entry</span>;

<span class="org-type">char</span> *
<span class="org-function-name">addr2name</span>(<span class="org-type">void</span> *<span class="org-variable-name">addr</span>)
{
  <span class="org-keyword">for</span> (<span class="org-type">entry</span> *<span class="org-variable-name">p</span> = (<span class="org-type">entry</span>*)(<span class="org-type">uintptr_t</span>)LATEST_LOC; p != <span class="org-constant">NULL</span>;
              p = (<span class="org-type">entry</span>*)(<span class="org-type">uintptr_t</span>)p-&gt;prev)
    <span class="org-keyword">if</span> ((<span class="org-type">uintptr_t</span>)p&lt;(<span class="org-type">uintptr_t</span>)addr)
      <span class="org-keyword">return</span> &amp;p-&gt;name_start;
  <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;
}

<span class="org-type">void</span>
<span class="org-function-name">print_frame_stack</span>() {
  printf(<span class="org-string">"Frames (bottom first)\n"</span>);
  <span class="org-keyword">for</span> (<span class="org-type">forth_instruction</span> **<span class="org-variable-name">i</span> = frame_stack_bottom; i &lt; frame_stack; ++i) {
    <span class="org-type">char</span> *<span class="org-variable-name">name</span> = addr2name(*i);
    printf(<span class="org-string">"%8p\t%s\n"</span>, *i, name!=<span class="org-constant">NULL</span>?name:<span class="org-string">"Cannot translate"</span>);
  }
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 24: </span><code>&lt;&lt;before main&gt;&gt;</code></label><pre class="src src-C" id="org03fffea"><span class="org-type">void</span>
<span class="org-function-name">print_next_inst</span>() {
  <span class="org-keyword">if</span> (next_inst != <span class="org-constant">NULL</span>) {
    <span class="org-type">char</span> *<span class="org-variable-name">name</span> = addr2name(next_inst);
    <span class="org-type">char</span> *<span class="org-variable-name">name_end</span> = name + ((<span class="org-type">ucell</span>*)name)[-1] + 1; <span class="org-comment-delimiter">// </span><span class="org-comment">name len + null byte</span>
    <span class="org-type">uintptr_t</span> <span class="org-variable-name">offset</span> = (<span class="org-type">uintptr_t</span>)name_end;
    offset = (offset+3) &amp; (~3); <span class="org-comment-delimiter">// </span><span class="org-comment">4-byte align</span>
    printf(<span class="org-string">"next inst:\n%8p\t%s+%lu\n"</span>, next_inst, name,
           ((<span class="org-type">uintptr_t</span>)next_inst)-offset);
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b809a5" class="outline-2">
<h2 id="org5b809a5"><span class="section-number-2">6.</span> Compiling input files</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 25: </span><code>&lt;&lt;includes&gt;&gt;</code></label><pre class="src src-C" id="org5f08c3c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;err.h&gt;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 26: </span><code>&lt;&lt;compile input files&gt;&gt;</code></label><pre class="src src-C" id="org72e7b3e"><span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; arguments.input_count; ++i)
{
  <span class="org-type">char</span> *<span class="org-variable-name">input</span> = arguments.inputs[i];
  <span class="org-type">FILE</span> *<span class="org-variable-name">f</span> = fopen(input, <span class="org-string">"r"</span>);
  <span class="org-keyword">if</span> (f == <span class="org-constant">NULL</span>) {
    err(1, <span class="org-string">"Failed to open input file %s"</span>, input);
  }
  <span class="org-comment-delimiter">// </span><span class="org-comment">set input stream to f;</span>
  input_stream = f;
  next_inst = &amp;forth_main;
  <span class="org-type">int</span> <span class="org-variable-name">exit_loop</span> = 0;
  <span class="org-keyword">while</span> (exit_loop != -1) { <span class="org-comment-delimiter">// </span><span class="org-comment">'next' trampoline</span>
    exit_loop = unpack_and_execute_instruction(*next_inst++);
  }
  fclose(f);
}
<span class="org-type">scell</span> *<span class="org-variable-name">compiled_input_end</span> = HERE_LOC;
input_stream = stdin;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a40683" class="outline-2">
<h2 id="org9a40683"><span class="section-number-2">7.</span> Outputting compiled heap</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 27: </span><code>&lt;&lt;includes&gt;&gt;</code></label><pre class="src src-C" id="org17aec82"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;endian.h&gt;</span>
</pre>
</div>

<p>
TODO: this won't convert properly, e.g. it will read chars as cells
and drop/byte swap them
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 28: </span><code>&lt;&lt;output compiled heap&gt;&gt;</code></label><pre class="src src-C" id="orge032072"><span class="org-keyword">if</span> (arguments.output != <span class="org-constant">NULL</span>) {
  <span class="org-type">FILE</span> *<span class="org-variable-name">output</span> = fopen(arguments.output, <span class="org-string">"w"</span>);
  <span class="org-keyword">if</span> (output == <span class="org-constant">NULL</span>) {
    err(2, <span class="org-string">"Failed to open output file %s"</span>, arguments.output);
  }
  <span class="org-keyword">switch</span> (arguments.target_word_size &lt;&lt; 1 | arguments.target_le)
  {
<span class="org-preprocessor">#define</span> <span class="org-variable-name">be_value</span> 0
<span class="org-preprocessor">#define</span> <span class="org-variable-name">le_value</span> 1
<span class="org-preprocessor">#define</span> <span class="org-function-name">mk_switch_case</span>(<span class="org-variable-name">bits</span>,<span class="org-variable-name">endian</span>)                                    \
    <span class="org-keyword">case</span> ((bits&lt;&lt;1)|endian##_value):                                   \
      <span class="org-keyword">for</span> (<span class="org-type">ucell</span> *<span class="org-variable-name">word</span> = heap_bottom; word &lt; (<span class="org-type">ucell</span>*)HERE_LOC; ++word) \
      { uint##bits##_t data = hto##endian##bits(*word);                \
        data += arguments.offset;                                      \
        fwrite(&amp;data, <span class="org-keyword">sizeof</span>(uint##bits##_t), 1, output);              \
      }                                                                \
      <span class="org-keyword">break</span>;
mk_switch_case(32, le);
mk_switch_case(32, be);
mk_switch_case(16, le);
mk_switch_case(16, be);
<span class="org-preprocessor">#undef</span> mk_switch_case
<span class="org-preprocessor">#undef</span> be_value
<span class="org-preprocessor">#undef</span> le_value
    <span class="org-keyword">default</span>:
      errx(3, <span class="org-string">"Unsupported target word-size &amp; endianness: %d %s"</span>,
           arguments.target_word_size, arguments.target_le==0?<span class="org-string">"be"</span>:<span class="org-string">"le"</span>);
  }
  fclose(output);
}
</pre>
</div>
</div>
</div>
