stage0-vm-unix-c-forth/forth-interpreter.html

<div id="outline-container-org8611ae8" class="outline-2">
<h2 id="org8611ae8"><span class="section-number-2">8.</span> Basic words</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgd073f96" class="outline-3">
<h3 id="orgd073f96"><span class="section-number-3">8.1.</span> C implementation</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 29: </span><b>c-words.c</b></label><pre class="src src-C" id="orgb1a663c"><span class="org-preprocessor">#include</span> <span class="org-string">"unix-c-forth.h"</span>

<span class="org-preprocessor">#define</span> <span class="org-variable-name">true</span> ((<span class="org-type">scell</span>)-1)
<span class="org-preprocessor">#define</span> <span class="org-variable-name">false</span> ((<span class="org-type">scell</span>)0)

<span class="org-type">scell</span> <span class="org-variable-name">STATE_LOC</span> = <span class="org-constant">false</span>;

<span class="org-preprocessor">#define</span> <span class="org-function-name">push</span>(<span class="org-variable-name">value</span>, <span class="org-variable-name">stack</span>) *stack++ = value;
<span class="org-preprocessor">#define</span> <span class="org-function-name">pop</span>(<span class="org-variable-name">value</span>, <span class="org-variable-name">stack</span>) value = *--stack;

<span class="org-type">int</span> <span class="org-variable-name">level</span> = 0;
<span class="org-type">int</span> <span class="org-function-name">forth_interpreter</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">to_execute</span>) {
  ++level;
  <span class="org-type">forth_instruction</span> *<span class="org-variable-name">frame</span> = (<span class="org-type">forth_instruction</span>*)(next_inst);
  push(frame, frame_stack);
  next_inst = to_execute;
<span class="org-preprocessor">#ifdef</span> TRACE
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; level; ++i) printf(<span class="org-string">"-"</span>);
  <span class="org-type">char</span> *<span class="org-variable-name">name</span> = addr2name(next_inst);
  printf(<span class="org-string">"&gt;\t%8p\t&gt; %s\n"</span>, next_inst, name!=<span class="org-constant">NULL</span>?name:<span class="org-string">"Cannot translate"</span>);
<span class="org-preprocessor">#endif</span>
  <span class="org-keyword">return</span> 0; <span class="org-comment-delimiter">// </span><span class="org-comment">'next' is a trampoline</span>
}

<span class="org-type">int</span> <span class="org-function-name">FEXIT</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
<span class="org-preprocessor">#ifdef</span> TRACE
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; level; ++i) printf(<span class="org-string">"-"</span>);
  <span class="org-type">char</span> *<span class="org-variable-name">name</span> = addr2name(next_inst);
  printf(<span class="org-string">"&lt;\t%8p\t&lt; %s\n"</span>, next_inst, name!=<span class="org-constant">NULL</span>?name:<span class="org-string">"Cannot translate"</span>);
<span class="org-preprocessor">#endif</span>
  --level;
  pop(<span class="org-type">forth_instruction</span> *<span class="org-variable-name">frame</span>, frame_stack);
  next_inst = frame;
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FEXECUTE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">c</span>, value_stack);
  <span class="org-keyword">return</span> unpack_and_execute_instruction((<span class="org-type">forth_instruction</span>)c);
}

<span class="org-type">int</span> <span class="org-function-name">FCELL_SIZE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  push(<span class="org-keyword">sizeof</span>(scell), value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FCHAR_SIZE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  push(<span class="org-keyword">sizeof</span>(<span class="org-type">char</span>), value_stack);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 30: </span><b>c-words.c</b></label><pre class="src src-C" id="orgdadd274"><span class="org-preprocessor">#define</span> <span class="org-function-name">binop</span>(<span class="org-variable-name">type</span>, <span class="org-variable-name">name</span>, <span class="org-variable-name">op</span>) <span class="org-type">int</span> <span class="org-function-name">F</span>##name(<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) { \
    pop(<span class="org-type">type</span> <span class="org-variable-name">b</span>, value_stack);                               \
    pop(<span class="org-type">type</span> <span class="org-variable-name">a</span>, value_stack);                               \
    push(op, value_stack);                                  \
    <span class="org-keyword">return</span> 0;                                               \
  }
<span class="org-preprocessor">#define</span> <span class="org-function-name">sbinop</span>(<span class="org-variable-name">name</span>, <span class="org-variable-name">op</span>) binop(scell, name, op)
<span class="org-preprocessor">#define</span> <span class="org-function-name">ubinop</span>(<span class="org-variable-name">name</span>, <span class="org-variable-name">op</span>) binop(ucell, name, op)

&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Binary</span>
<span class="org-function-name">sbinop</span>(ADD, a+b);
<span class="org-function-name">sbinop</span>(SUB, a-b);
<span class="org-function-name">sbinop</span>(STAR, <span class="org-type">a</span>*<span class="org-variable-name">b</span>);
<span class="org-function-name">sbinop</span>(SLASH, a/b);
<span class="org-function-name">sbinop</span>(LSHIFT, a&lt;&lt;b);
<span class="org-function-name">sbinop</span>(RSHIFT, a&gt;&gt;b);
<span class="org-function-name">sbinop</span>(EQUAL, a==b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">sbinop</span>(NOT_EQUAL, a!=b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">sbinop</span>(LESS_THAN, a&lt;b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">sbinop</span>(GREATER_THAN, a&gt;b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">ubinop</span>(U_LESS_THAN, a&lt;b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">ubinop</span>(U_GREATER_THAN, a&gt;b?<span class="org-constant">true</span>:<span class="org-constant">false</span>);
<span class="org-function-name">sbinop</span>(AND, a&amp;b);
<span class="org-function-name">sbinop</span>(OR, a|b);

<span class="org-type">int</span> <span class="org-function-name">FNEGATE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  push(-a, value_stack);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 31: </span><b>c-words.c</b></label><pre class="src src-C" id="org5ed570a">&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Boolean</span>

<span class="org-type">int</span> <span class="org-function-name">FINVERT</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  push(~a, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FTRUE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  push(<span class="org-constant">true</span>, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FFALSE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  push(<span class="org-constant">false</span>, value_stack);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 32: </span><b>c-words.c</b></label><pre class="src src-C" id="orge2e3c6f"><span class="org-comment-delimiter">// </span><span class="org-comment">TODO: categorize</span>
<span class="org-type">int</span> <span class="org-function-name">FEMIT</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">a</span>, value_stack);
  <span class="org-type">int</span> <span class="org-variable-name">s</span> = EOF;
  <span class="org-keyword">while</span> (((s = putc(a, output_stream)) == EOF) &amp;&amp;
         (<span class="org-negation-char">!</span>feof(output_stream))) { }
  <span class="org-keyword">return</span> feof(output_stream)?-1:0;
}

<span class="org-type">int</span> <span class="org-function-name">FKEY</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  <span class="org-type">int</span> <span class="org-variable-name">c</span> = EOF;
  <span class="org-keyword">while</span> (((c = getc(input_stream)) == EOF) &amp;&amp;
         (<span class="org-negation-char">!</span>feof(input_stream))) { }
  <span class="org-keyword">if</span> (feof(input_stream)) <span class="org-keyword">return</span> -1;
  push(c, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FBYE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  <span class="org-keyword">return</span> -1;
}

<span class="org-type">int</span> <span class="org-function-name">FLIT</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  <span class="org-type">scell</span> <span class="org-variable-name">value</span> = *(<span class="org-type">scell</span>*)next_inst++;
  push(value, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FC_COMMA</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) { <span class="org-comment-delimiter">/* </span><span class="org-comment">TODO: HERE ! CHAR-SIZE ALLOT</span><span class="org-comment-delimiter"> */</span>
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  <span class="org-type">char</span> *<span class="org-variable-name">charheap</span> = (<span class="org-type">char</span> *)HERE_LOC;
  *charheap++ = (<span class="org-type">char</span>)a;
  HERE_LOC = (<span class="org-type">scell</span> *)charheap;
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FCOMMA</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) { <span class="org-comment-delimiter">/* </span><span class="org-comment">TODO: HERE ! CELL-SIZE ALLOT</span><span class="org-comment-delimiter"> */</span>
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  *HERE_LOC++ = a;
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 33: </span><b>c-words.c</b></label><pre class="src src-C" id="org8053702">&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Memory</span>
<span class="org-type">int</span> <span class="org-function-name">FC_STORE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">addr</span>, value_stack);
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">value</span>, value_stack);
  *(<span class="org-type">unsigned</span> <span class="org-type">char</span>*)(<span class="org-type">uintptr_t</span>)addr = (<span class="org-type">unsigned</span> <span class="org-type">char</span>)value;
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FC_FETCH</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">a</span>, value_stack);
  push(*(<span class="org-type">char</span>*)(<span class="org-type">uintptr_t</span>)a, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FSTORE</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">addr</span>, value_stack);
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">value</span>, value_stack);
  *(<span class="org-type">ucell</span>*)(<span class="org-type">uintptr_t</span>)addr = value;
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FFETCH</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">ucell</span> <span class="org-variable-name">a</span>, value_stack);
  push(*(scell*)(uintptr_t)a, value_stack);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 34: </span><b>c-words.c</b></label><pre class="src src-C" id="org255d782">&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Stack</span>

<span class="org-type">int</span> <span class="org-function-name">FDUP</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  push(a, value_stack);
  push(a, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FDROP</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FNIP</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  pop(<span class="org-type">scell</span> <span class="org-variable-name">b</span>, value_stack);
  push(a, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FOVER</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  <span class="org-type">scell</span> <span class="org-variable-name">value</span> = *(value_stack-2);
  push(value, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FPICK</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">u</span>, value_stack);
  <span class="org-type">scell</span> *<span class="org-variable-name">picked</span> =  value_stack - 1 - u;
  push(*picked, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FSWAP</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  pop(<span class="org-type">scell</span> <span class="org-variable-name">b</span>, value_stack);
  push(a, value_stack);
  push(b, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FROT</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">x3</span>, value_stack);
  pop(<span class="org-type">scell</span> <span class="org-variable-name">x2</span>, value_stack);
  pop(<span class="org-type">scell</span> <span class="org-variable-name">x1</span>, value_stack);
  push(x2, value_stack);
  push(x3, value_stack);
  push(x1, value_stack);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 35: </span><b>c-words.c</b></label><pre class="src src-C" id="orgdceb693">&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Return stack</span>

<span class="org-type">int</span> <span class="org-function-name">FR_FETCH</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  <span class="org-type">scell</span> <span class="org-variable-name">value</span> = *(<span class="org-type">scell</span>*)(frame_stack-1);
  push(value, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FR_FROM</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  --frame_stack;
  <span class="org-type">scell</span> <span class="org-variable-name">a</span> = *(<span class="org-type">scell</span>*)frame_stack;
  push(a, value_stack);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FTO_R</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  *(<span class="org-type">scell</span>*)frame_stack = a;
  ++frame_stack;
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 36: </span><b>c-words.c</b></label><pre class="src src-C" id="org3c49349">&#12; <span class="org-comment-delimiter">// </span><span class="org-comment">Branches</span>

<span class="org-type">int</span> <span class="org-function-name">FBRANCH</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  next_inst += (*(<span class="org-type">scell</span> *)next_inst)/<span class="org-keyword">sizeof</span>(*next_inst);
  <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">FZBRANCH</span> (<span class="org-type">forth_instruction</span> *<span class="org-variable-name">_</span>) {
  pop(<span class="org-type">scell</span> <span class="org-variable-name">a</span>, value_stack);
  <span class="org-keyword">if</span> (a==0) next_inst += (*(<span class="org-type">scell</span> *)next_inst)/<span class="org-keyword">sizeof</span>(*next_inst);
  <span class="org-keyword">else</span> ++next_inst; <span class="org-comment-delimiter">// </span><span class="org-comment">skip over target</span>
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
