stage0-vm-unix-c-forth/forth-interpreter.html
<div id="outline-container-org82a152f" class="outline-3">
<h3 id="org82a152f"><span class="section-number-3">8.2.</span> Mapping to dictionary entries</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 37: </span><b>c-words.s</b></label><pre class="src src-asm" id="org66a48fd"><span class="org-keyword">.macro</span> .fw word:req, rest:vararg
  <span class="org-keyword">.ifnc</span> <span class="org-string">"\word"</span>,<span class="org-string">"L"</span>
    <span class="org-keyword">.4byte</span> \word <span class="org-comment-delimiter">/* </span><span class="org-comment">FWSIZE */</span>
  <span class="org-keyword">.endif</span>
  <span class="org-keyword">.ifnb</span> \rest
    <span class="org-keyword">.fw</span> \rest
  <span class="org-keyword">.endif</span>
<span class="org-keyword">.endm</span>

<span class="org-keyword">.macro</span> .cell init=0
  <span class="org-keyword">.4byte</span> \init
<span class="org-keyword">.endm</span>

<span class="org-keyword">.set</span> previous_entry, 0
<span class="org-keyword">.macro</span> .entry name:req, label, imm=0, hid=0
  <span class="org-keyword">.ifc</span> _,\label
    <span class="org-keyword">.entry</span> \name, \name, \imm, \hid
  <span class="org-keyword">.else</span>
    <span class="org-keyword">.balign</span> 4 <span class="org-comment-delimiter">/* </span><span class="org-comment">Align to power of 2 */</span>
    <span class="org-keyword">.globl</span> FHDR_\label
    <span class="org-keyword">FHDR_</span>\label :
    <span class="org-keyword">1</span>:.cell previous_entry
    <span class="org-keyword">.set</span> previous_entry, 1b
    <span class="org-keyword">.byte</span> \hid, \imm
    <span class="org-keyword">.balign</span> 4
    <span class="org-keyword">.cell</span> 2f-3f
    <span class="org-keyword">3</span>:.ascii <span class="org-string">"\name"</span>
    <span class="org-keyword">2</span>:.byte 0
    <span class="org-keyword">.balign</span> 4 <span class="org-comment-delimiter">/* </span><span class="org-comment">Align to power of 2 */</span>
    <span class="org-keyword">.globl</span> \label
    \label :
  <span class="org-keyword">.endif</span>
<span class="org-keyword">.endm</span>

<span class="org-keyword">.macro</span> .forth_interpreter
  <span class="org-keyword">.cell</span> forth_interpreter
<span class="org-keyword">.endm</span>

<span class="org-keyword">.macro</span> fromC name, label, rest:vararg
  <span class="org-keyword">.ifc</span> _,\label
    <span class="org-keyword">fromC</span> \name, \name
  <span class="org-keyword">.else</span>
    <span class="org-keyword">.entry</span> \name, \label
    <span class="org-keyword">.fw</span> F\label, 0
  <span class="org-keyword">.endif</span>
  <span class="org-keyword">.ifnb</span> \rest
    <span class="org-keyword">fromC</span> \rest
  <span class="org-keyword">.endif</span>
<span class="org-keyword">.endm</span>

<span class="org-function-name">fromC</span> <span class="org-keyword">KEY</span>, _, EMIT, _
<span class="org-function-name">fromC</span> <span class="org-keyword">BYE</span>, _, EXIT, _, EXECUTE, _
<span class="org-function-name">fromC</span> <span class="org-string">"[']"</span>, LIT

<span class="org-function-name">fromC</span> <span class="org-string">"+"</span>, ADD, <span class="org-string">"-"</span>, SUB, <span class="org-string">"*"</span>, STAR, <span class="org-string">"/"</span>, SLASH
<span class="org-function-name">fromC</span> <span class="org-string">"&lt;"</span>, LESS_THAN, <span class="org-string">"&gt;"</span>, GREATER_THAN
<span class="org-function-name">fromC</span> <span class="org-string">"U&lt;"</span>, U_LESS_THAN, <span class="org-string">"U&gt;"</span>, U_GREATER_THAN
<span class="org-function-name">fromC</span> <span class="org-string">"&lt;&gt;"</span>, NOT_EQUAL, <span class="org-string">"\x3d"</span>, EQUAL
<span class="org-function-name">fromC</span> <span class="org-keyword">OR</span>, _, AND, _, LSHIFT, _, RSHIFT, _, INVERT, _, NEGATE, _
<span class="org-function-name">fromC</span> <span class="org-string">"C!"</span>, C_STORE, <span class="org-string">"C@"</span>, C_FETCH, <span class="org-string">"!"</span>, STORE, <span class="org-string">"@"</span>, FETCH
<span class="org-function-name">fromC</span> <span class="org-string">"CELL-SIZE"</span>, CELL_SIZE, <span class="org-string">"CHAR-SIZE"</span>, CHAR_SIZE

<span class="org-function-name">fromC</span> <span class="org-keyword">DUP</span>, _, DROP, _, NIP, _, OVER, _, PICK, _, ROT, _, SWAP, _
<span class="org-function-name">fromC</span> <span class="org-string">"R@"</span>, R_FETCH, <span class="org-string">"R&gt;"</span>, R_FROM, <span class="org-string">"&gt;R"</span>, TO_R

<span class="org-function-name">fromC</span> <span class="org-keyword">BRANCH</span>, _, <span class="org-string">"?BRANCH"</span>, ZBRANCH<span class="org-comment-delimiter">;</span>

<span class="org-keyword">.entry</span> <span class="org-string">"&lt;FORTH_MAIN&gt;"</span>, forth_main, 0, -1
<span class="org-keyword">.fw</span> QUIT
<span class="org-keyword">.fw</span> BYE
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2aa4d28" class="outline-2">
<h2 id="org2aa4d28"><span class="section-number-2">9.</span> <code>[0/1]</code> Tasks</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org75f118d" class="outline-3">
<h3 id="org75f118d"><span class="section-number-3">9.1.</span> <span class="todo TODO">TODO</span> Linker</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Have the <code>unix-c-forth</code> interpreter output a file containing
appropriately sized words, but not relinked, and a file with the
symbols; then have another program to re-link it to say the bare-metal
raspberry pi
</p>
</div>
<div id="outline-container-org1b3d506" class="outline-4">
<h4 id="org1b3d506"><span class="section-number-4">9.1.1.</span> Dynamic linking</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
The ideas of GOT/PLT, and a relocation register, changed when changing
libraries, should be applicable here too.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Kovacsics (rmk35)</p>
<p class="date">Created: 2022-01-02 Sun 02:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
